In [8]:
import pandas as pd

<h3>Series</h3>

In [10]:
s=pd.Series([34,5,23,234,547,22,56])

In [11]:
s

0     34
1      5
2     23
3    234
4    547
5     22
6     56
dtype: int64

In [12]:
type(s)

pandas.core.series.Series

In [13]:
#accessing content from the series
s[2]

23

In [14]:
s.shape

(7,)

In [15]:
s.size
s

0     34
1      5
2     23
3    234
4    547
5     22
6     56
dtype: int64

In [16]:
s.dtype

dtype('int64')

In [17]:
import numpy as np

In [18]:
s1=pd.Series([12,23,34,45,56,54,78,24],index=range(100,108),dtype=np.int8)
s1

100    12
101    23
102    34
103    45
104    56
105    54
106    78
107    24
dtype: int8

In [19]:
s1[104]

56

In [20]:
s1.min()

12

In [21]:
s1.max()

78

In [22]:
s1.mean()

40.75

In [23]:
s1.sum()

326

In [24]:
s1.std()

21.651459865000195

<h3>Data Frame</h3>

In [26]:
#mitu.co.in/dataset
r=pd.Series([1,2,3,4,5])
n=pd.Series(['ajay','ram','ojas','venky','nitin'])
m=pd.Series([64.8,73.9,22.6,63.7,25.5])

In [27]:
df=pd.DataFrame({
    'roll':r,
    'name':n,
    'marks':m
})

In [28]:
df.head()

   roll   name  marks
0     1   ajay   64.8
1     2    ram   73.9
2     3   ojas   22.6
3     4  venky   63.7
4     5  nitin   25.5

In [29]:
df.name[3],df.marks[3]

('venky', 63.7)

In [30]:
df.shape

(5, 3)

In [31]:
df.size

15

In [32]:
df.ndim

2

In [33]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

In [34]:
import os
os.getcwd()

'C:\\Users\\duasp\\DP'

In [35]:
ls

 Volume in drive C has no label.
 Volume Serial Number is 985B-2269

 Directory of C:\Users\duasp\DP

09/25/2024  07:54 AM    <DIR>          .
09/25/2024  07:54 AM    <DIR>          ..
09/25/2024  07:51 AM    <DIR>          .ipynb_checkpoints
09/24/2024  01:42 PM            15,401 Assignment-1.ipynb
09/25/2024  07:54 AM           144,816 data Pro&Anal .ipynb
09/24/2024  01:42 PM           123,490 Linear-Algebra-Decomposition.ipynb
09/24/2024  01:42 PM            64,792 matrix.ipynb
09/24/2024  01:42 PM            69,222 numpy.ipynb
09/24/2024  01:42 PM           197,510 python data structures.ipynb
               6 File(s)        615,231 bytes
               3 Dir(s)  162,243,231,744 bytes free

In [36]:
df=pd.read_csv('student.csv')

FileNotFoundError: [Errno 2] No such file or directory: 'student.csv'

In [ ]:
df

In [ ]:
df.tail()

In [ ]:
df.shape

In [ ]:
df2=pd.read_csv('student1.csv',names=['Roll no','Name','Year','marks','Age'])

In [ ]:
df2

In [ ]:
df3=pd.read_csv('student3.tsv',sep='\t')

In [ ]:
df3

In [ ]:
iris=pd.read_csv('https://gist.githubusercontent.com/curran/a08a1080b88344b0c8a7/raw/0e7a9b0a5d22642a06d3d5b9bcbad9890c8ee534/iris.csv')

In [ ]:
iris

#slysing operation, individual col is a series

In [ ]:
iris.columns

In [ ]:
iris.shape

In [ ]:
iris.size

In [ ]:
df

In [ ]:
df.shape

In [ ]:
df.values

In [ ]:
df.columns

In [ ]:
df.head()

In [ ]:
df.tail()

In [ ]:
df.loc[9]

In [247]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

#slicing index based

In [245]:
x=df.iloc[2:9,1:5]
x

      name class  marks  age
2   aniket    BE  76.88   19
3  ajinkya    TE  69.66   20
4     asha    TE  63.28   20
5   ayesha    BE  49.55   20
6     amar    BE  65.34   19
7    amita    BE  68.33   23
8     amol    TE  56.75   20

In [ ]:
df.iloc[4:,:4]

In [ ]:
df.iloc[:,:4]

In [ ]:
df.iloc[1:,:2]

In [ ]:
df.iloc[[4,7,6,2],:]

In [ ]:
df.iloc[[4,2,1],[4,2,3]]

In [ ]:
df.iloc[5,2:4]

In [ ]:
df.iloc[[5],:]

In [255]:
df.iloc[:,[1]]

      name
0     anil
1     amit
2   aniket
3  ajinkya
4     asha
5   ayesha
6     amar
7    amita
8     amol
9    anmol

<h3>Label Based Slicing</h3>

In [251]:
df.loc[:,["name"]]

      name
0     anil
1     amit
2   aniket
3  ajinkya
4     asha
5   ayesha
6     amar
7    amita
8     amol
9    anmol

In [253]:
df.loc[:,["name","marks"]]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [ ]:
df["name"]

In [ ]:
df[["name", "marks"]]

In [ ]:
df.drop([5,9,2])

In [249]:
df.drop(["class"],axis=1)

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [ ]:
df.drop(["class","age"],axis=1)

In [ ]:
#functions

In [ ]:
df["marks"].count()

In [ ]:
df["marks"].mean()

In [ ]:
df["marks"].min()

In [257]:
df["marks"].median()

64.31

In [259]:
df["marks"].argmax()

9

In [261]:
df["marks"].argmin()

5

In [ ]:
df["marks"].std()

In [ ]:
df['class'].value_counts()

In [ ]:
df['age'].value_counts()

In [ ]:
df['class'].mode()

In [263]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

In [ ]:
df.min(),df.max()

In [265]:
df.mean(numeric_only=True)

roll      5.500
marks    64.499
age      20.500
dtype: float64

In [ ]:
df.mean(numeric_only=True, axis=1)

<h3>Custom Column Operations</h3>

In [271]:
df['marks']/10

0    5.677
1    5.977
2    7.688
3    6.966
4    6.328
5    4.955
6    6.534
7    6.833
8    5.675
9    7.866
Name: marks, dtype: float64

In [273]:
df['marks']=df['marks']+0.5
df

   roll     name class  marks  age
0     1     anil    TE  57.27   22
1     2     amit    TE  60.27   21
2     3   aniket    BE  77.38   19
3     4  ajinkya    TE  70.16   20
4     5     asha    TE  63.78   20
5     6   ayesha    BE  50.05   20
6     7     amar    BE  65.84   19
7     8    amita    BE  68.83   23
8     9     amol    TE  57.25   20
9    10    anmol    BE  79.16   21

In [275]:
df['cgpa']=df['marks']/10+0.27
df

   roll     name class  marks  age   cgpa
0     1     anil    TE  57.27   22  5.997
1     2     amit    TE  60.27   21  6.297
2     3   aniket    BE  77.38   19  8.008
3     4  ajinkya    TE  70.16   20  7.286
4     5     asha    TE  63.78   20  6.648
5     6   ayesha    BE  50.05   20  5.275
6     7     amar    BE  65.84   19  6.854
7     8    amita    BE  68.83   23  7.153
8     9     amol    TE  57.25   20  5.995
9    10    anmol    BE  79.16   21  8.186

In [277]:
x = ['M','M','M','M','F','F','M','M','M','M']

In [279]:
df["gender"] = x

In [281]:
df

   roll     name class  marks  age   cgpa gender
0     1     anil    TE  57.27   22  5.997      M
1     2     amit    TE  60.27   21  6.297      M
2     3   aniket    BE  77.38   19  8.008      M
3     4  ajinkya    TE  70.16   20  7.286      M
4     5     asha    TE  63.78   20  6.648      F
5     6   ayesha    BE  50.05   20  5.275      F
6     7     amar    BE  65.84   19  6.854      M
7     8    amita    BE  68.83   23  7.153      M
8     9     amol    TE  57.25   20  5.995      M
9    10    anmol    BE  79.16   21  8.186      M

In [283]:
df=pd.read_csv('student.csv')

In [285]:
ndf=pd.DataFrame({
    'roll':range(1,11),
    'cgpa':df['marks']/10+0.27,
    'gender':['M','M','M','M','F','F','M','F','M','M']
})

In [287]:
ndf

   roll   cgpa gender
0     1  5.947      M
1     2  6.247      M
2     3  7.958      M
3     4  7.236      M
4     5  6.598      F
5     6  5.225      F
6     7  6.804      M
7     8  7.103      F
8     9  5.945      M
9    10  8.136      M

In [289]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [291]:
df.shape,ndf.shape

((10, 5), (10, 3))

In [293]:
df.merge(ndf, on='roll')

   roll     name class  marks  age   cgpa gender
0     1     anil    TE  56.77   22  5.947      M
1     2     amit    TE  59.77   21  6.247      M
2     3   aniket    BE  76.88   19  7.958      M
3     4  ajinkya    TE  69.66   20  7.236      M
4     5     asha    TE  63.28   20  6.598      F
5     6   ayesha    BE  49.55   20  5.225      F
6     7     amar    BE  65.34   19  6.804      M
7     8    amita    BE  68.33   23  7.103      F
8     9     amol    TE  56.75   20  5.945      M
9    10    anmol    BE  78.66   21  8.136      M

In [295]:
df5=pd.read_csv('student5.csv')

In [297]:
df5

   roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [299]:
df5.shape

(5, 5)

In [301]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [303]:
df5.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [305]:
pd.concat([df,df5], ignore_index=True)

    roll     name class  marks  age
0      1     anil    TE  56.77   22
1      2     amit    TE  59.77   21
2      3   aniket    BE  76.88   19
3      4  ajinkya    TE  69.66   20
4      5     asha    TE  63.28   20
5      6   ayesha    BE  49.55   20
6      7     amar    BE  65.34   19
7      8    amita    BE  68.33   23
8      9     amol    TE  56.75   20
9     10    anmol    BE  78.66   21
10     1   surbhi    TE  67.44   23
11     2    sujay    TE  74.12   22
12     3  subhash    BE  82.44   21
13     4   sachin    TE  59.33   21
14     5  shalini    TE  63.45   20

<h3>Grouping and aggregation</h3>

In [ ]:
gr=df.groupby('class')

In [ ]:
gr.groups

In [ ]:
gr.get_group('TE')

In [ ]:
gr['marks'].max()

In [ ]:
gr['roll'].median()

In [ ]:
gr['age'].value_counts()

In [ ]:
gr.min()

In [ ]:
gr.describe()

<h3>String Functions</h3>

In [ ]:
name='Tushar'
name.upper()

In [130]:
import os
os.getcwd()

'C:\\Users\\duasp\\DP'

In [128]:
df['name'].str.upper()

0     AJAY
1      RAM
2     OJAS
3    VENKY
4    NITIN
Name: name, dtype: object

In [132]:
cd ..

C:\Users\duasp

In [134]:
cd students/

C:\Users\duasp\students

In [136]:
df=pd.read_csv('student.csv')

In [140]:
df['name'].str.upper()

0       ANIL
1       AMIT
2     ANIKET
3    AJINKYA
4       ASHA
5     AYESHA
6       AMAR
7      AMITA
8       AMOL
9      ANMOL
Name: name, dtype: object

In [144]:
df['name'].str.isupper()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: name, dtype: bool

In [146]:
df['name'].str.startswith('an')

0     True
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
Name: name, dtype: bool

In [160]:
df['name'].str.endswith('ol')

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
9     True
Name: name, dtype: bool

In [162]:
df['name'].str.find('i')#-1 means not present

0    2
1    2
2    2
3    2
4   -1
5   -1
6   -1
7    2
8   -1
9   -1
Name: name, dtype: int64

In [164]:
df['name'].str.repeat(2)

0          anilanil
1          amitamit
2      aniketaniket
3    ajinkyaajinkya
4          ashaasha
5      ayeshaayesha
6          amaramar
7        amitaamita
8          amolamol
9        anmolanmol
Name: name, dtype: object

In [173]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [166]:
df['name'].str.count('a')

0    1
1    1
2    1
3    2
4    2
5    2
6    2
7    2
8    1
9    1
Name: name, dtype: int64

In [168]:
df['name'].str.contains('n')

0     True
1    False
2     True
3     True
4    False
5    False
6    False
7    False
8    False
9     True
Name: name, dtype: bool

In [175]:
df['name'].str.len()

0    4
1    4
2    6
3    7
4    4
5    6
6    4
7    5
8    4
9    5
Name: name, dtype: int64

In [183]:
df['name'].str.replace('i','ee')

0       aneel
1       ameet
2     aneeket
3    ajeenkya
4        asha
5      ayesha
6        amar
7      ameeta
8        amol
9       anmol
Name: name, dtype: object

<h3>Sorting</h3>

In [186]:
df.sort_values('class')

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20

In [192]:
df.sort_values(['class','age'])

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
6     7     amar    BE  65.34   19
5     6   ayesha    BE  49.55   20
9    10    anmol    BE  78.66   21
7     8    amita    BE  68.33   23
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20
1     2     amit    TE  59.77   21
0     1     anil    TE  56.77   22

In [194]:
df.sort_values(['class','age','marks'])

   roll     name class  marks  age
6     7     amar    BE  65.34   19
2     3   aniket    BE  76.88   19
5     6   ayesha    BE  49.55   20
9    10    anmol    BE  78.66   21
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
4     5     asha    TE  63.28   20
3     4  ajinkya    TE  69.66   20
1     2     amit    TE  59.77   21
0     1     anil    TE  56.77   22

In [198]:
df.sort_values('marks',ascending=True)

   roll     name class  marks  age
5     6   ayesha    BE  49.55   20
8     9     amol    TE  56.75   20
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
3     4  ajinkya    TE  69.66   20
2     3   aniket    BE  76.88   19
9    10    anmol    BE  78.66   21

<h3>boolean filtering</h3>

In [207]:
mask=df['marks']>50

In [203]:
df['age']>=20

0     True
1     True
2    False
3     True
4     True
5     True
6    False
7     True
8     True
9     True
Name: age, dtype: bool

In [205]:
df['roll']>=5

0    False
1    False
2    False
3    False
4     True
5     True
6     True
7     True
8     True
9     True
Name: roll, dtype: bool

In [211]:
df[mask]

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [215]:
df[df['marks']>60]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [219]:
x=df[(df['marks']>60) & (df['class']=='BE')]
x

   roll    name class  marks  age
2     3  aniket    BE  76.88   19
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
9    10   anmol    BE  78.66   21

In [312]:
x=df[df['name'].str.startswith('an') & (df['age']>=20)]
x

   roll   name class  marks  age
0     1   anil    TE  56.77   22
9    10  anmol    BE  78.66   21

<h3>Export the data</h3>

In [314]:
x.to_json('outputjson.csv',index=False)